const data = `大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人学校招聘考试 春{第3-3|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人学校招聘考试 春{第3-3|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人学校招聘考试 春{第3-3|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人学校招聘考试 春{第3-3|2节/周}【借用】人
    线性代数（甲）春夏{第1-8周|3节/周}钱英紫金港东1B-306(多)【全日制本科生】103人
    线性代数（甲）春夏{第1-8周|3节/周}钱英紫金港东1B-306(多)【全日制本科生】103人
    线性代数（甲）春夏{第1-8周|3节/周}钱英紫金港东1B-306(多)【全日制本科生】103人
    线性代数（甲）春夏{第1-8周|3节/周}钱英紫金港东1B-306(多)【全日制本科生】103人
    线性代数（甲）春夏{第1-8周|3节/周}钱英紫金港东1B-306(多)【全日制本科生】103人
    线性代数（甲）春夏{第1-8周|3节/周}钱英紫金港东1B-306(多)【全日制本科生】103人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}郑大方紫金港东1B-306(多)【全日制本科生】58人
    考试春{第9周|2节}【考试】人普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    考试春{第9周|2节}【考试】人普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    考试春{第9周|2节}【考试】人普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    考试春{第9周|2节}【考试】人普通物理学Ⅰ（H）春夏{第1-8周|2节/周}万歆/路欣紫金港东1B-306(多)【全日制本科生】126人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人考试春{第9周|2节}【考试】人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人考试春{第9周|2节}【考试】人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人考试春{第9周|2节}【考试】人
    大学物理（甲）Ⅰ春夏{第1-8周|2节/周}赵学安紫金港东1B-306(多)【全日制本科生】52人考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人
    考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人
    考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人
    考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人
    考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人
    考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人
    考试春{第9周|2节}【考试】人补课春{第6-6|3节/周}【借用】人学校招聘考试 春{第3-3|3节/周}【借用】人
    考试春{第9周|2节}【考试】人补课春{第6-6|3节/周}【借用】人学校招聘考试 春{第3-3|3节/周}【借用】人
    考试春{第9周|2节}【考试】人补课春{第6-6|3节/周}【借用】人学校招聘考试 春{第3-3|3节/周}【借用】人
    考试春{第9周|2节}【考试】人补课春{第6-6|3节/周}【借用】人学校招聘考试 春{第3-3|3节/周}【借用】人
    考试春{第9周|2节}【考试】人补课春{第6-6|3节/周}【借用】人学校招聘考试 春{第3-3|3节/周}【借用】人
    考试春{第9周|2节}【考试】人补课春{第6-6|3节/周}【借用】人学校招聘考试 春{第3-3|3节/周}【借用】人
    线性代数（甲）春夏{第1-8周|1节/周}钱英紫金港东1B-306(多)【全日制本科生】124人
    线性代数（甲）春夏{第1-8周|1节/周}钱英紫金港东1B-306(多)【全日制本科生】124人
    无机及分析化学春夏{第1-8周|1节/周}边平凤紫金港东1B-306(多)【全日制本科生】124人
    无机及分析化学春夏{第1-8周|1节/周}边平凤紫金港东1B-306(多)【全日制本科生】124人
    微电子制造与纳米技术春{第1-8周|1节/周}吴坚紫金港东1B-306(多)【全日制本科生】15人
    微电子制造与纳米技术春{第1-8周|1节/周}吴坚紫金港东1B-306(多)【全日制本科生】15人
    博士生入学考试春{第2-2|1节/周}【借用】人补课春{第6-6|1节/周}【借用】人
    博士生入学考试春{第2-2|1节/周}【借用】人补课春{第6-6|1节/周}【借用】人
    补课春{第6-6|1节/周}【借用】人
    补课春{第6-6|1节/周}【借用】人
    线性代数（甲）春夏{第1-8周|2节/周}钱英紫金港东1B-306(多)【全日制本科生】124人
    线性代数（甲）春夏{第1-8周|2节/周}钱英紫金港东1B-306(多)【全日制本科生】124人
    线性代数（甲）春夏{第1-8周|2节/周}钱英紫金港东1B-306(多)【全日制本科生】124人
    线性代数（甲）春夏{第1-8周|2节/周}钱英紫金港东1B-306(多)【全日制本科生】124人
    无机及分析化学春夏{第1-8周|2节/周}边平凤紫金港东1B-306(多)【全日制本科生】124人
    无机及分析化学春夏{第1-8周|2节/周}边平凤紫金港东1B-306(多)【全日制本科生】124人
    无机及分析化学春夏{第1-8周|2节/周}边平凤紫金港东1B-306(多)【全日制本科生】124人
    无机及分析化学春夏{第1-8周|2节/周}边平凤紫金港东1B-306(多)【全日制本科生】124人
    微电子制造与纳米技术春{第1-8周|2节/周}吴坚紫金港东1B-306(多)【全日制本科生】15人
    微电子制造与纳米技术春{第1-8周|2节/周}吴坚紫金港东1B-306(多)【全日制本科生】15人
    微电子制造与纳米技术春{第1-8周|2节/周}吴坚紫金港东1B-306(多)【全日制本科生】15人
    微电子制造与纳米技术春{第1-8周|2节/周}吴坚紫金港东1B-306(多)【全日制本科生】15人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    传播学概论春{第1-8周|2节/周}叶琼丰紫金港东1B-306(多)【全日制本科生】108人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    开会春{第1-8|2节/周}【借用】人
    楼层春{第2-2|2节/周}【借用】人
    楼层春{第2-2|2节/周}【借用】人
    楼层春{第2-2|2节/周}【借用】人
    楼层春{第2-2|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    博士生入学考试春{第2-2|2节/周}【借用】人补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    补课春{第6-6|2节/周}【借用】人
    茶与健康春{第1-8周|3节/周}何普明/王岳飞紫金港东1B-306(多)【全日制本科生】135人
    茶与健康春{第1-8周|3节/周}何普明/王岳飞紫金港东1B-306(多)【全日制本科生】135人
    茶与健康春{第1-8周|3节/周}何普明/王岳飞紫金港东1B-306(多)【全日制本科生】135人
    茶与健康春{第1-8周|3节/周}何普明/王岳飞紫金港东1B-306(多)【全日制本科生】135人
    茶与健康春{第1-8周|3节/周}何普明/王岳飞紫金港东1B-306(多)【全日制本科生】135人
    茶与健康春{第1-8周|3节/周}何普明/王岳飞紫金港东1B-306(多)【全日制本科生】135人
    应用运筹学春{第1-8周|3节/周}谈之奕紫金港东1B-306(多)【全日制本科生】120人
    应用运筹学春{第1-8周|3节/周}谈之奕紫金港东1B-306(多)【全日制本科生】120人
    应用运筹学春{第1-8周|3节/周}谈之奕紫金港东1B-306(多)【全日制本科生】120人
    应用运筹学春{第1-8周|3节/周}谈之奕紫金港东1B-306(多)【全日制本科生】120人
    应用运筹学春{第1-8周|3节/周}谈之奕紫金港东1B-306(多)【全日制本科生】120人
    应用运筹学春{第1-8周|3节/周}谈之奕紫金港东1B-306(多)【全日制本科生】120人
    管理你的健康春{第1-8周|3节/周}朱善宽/马晓光紫金港东1B-306(多)【全日制本科生】117人
    管理你的健康春{第1-8周|3节/周}朱善宽/马晓光紫金港东1B-306(多)【全日制本科生】117人
    管理你的健康春{第1-8周|3节/周}朱善宽/马晓光紫金港东1B-306(多)【全日制本科生】117人
    管理你的健康春{第1-8周|3节/周}朱善宽/马晓光紫金港东1B-306(多)【全日制本科生】117人
    管理你的健康春{第1-8周|3节/周}朱善宽/马晓光紫金港东1B-306(多)【全日制本科生】117人
    管理你的健康春{第1-8周|3节/周}朱善宽/马晓光紫金港东1B-306(多)【全日制本科生】117人
    考试春{第9周|2节}【考试】人楼层春{第2-2|3节/周}【借用】人
    考试春{第9周|2节}【考试】人楼层春{第2-2|3节/周}【借用】人
    考试春{第9周|2节}【考试】人楼层春{第2-2|3节/周}【借用】人
    考试春{第9周|2节}【考试】人楼层春{第2-2|3节/周}【借用】人
    考试春{第9周|2节}【考试】人楼层春{第2-2|3节/周}【借用】人
    考试春{第9周|2节}【考试】人楼层春{第2-2|3节/周}【借用】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    考试春{第9周|2节}【考试】人
    形势与政策Ⅰ春夏{第1-8周|2节/单周}胡义镰紫金港东1B-306(多)【全日制本科生】81人
    形势与政策Ⅰ春夏{第1-8周|2节/单周}胡义镰紫金港东1B-306(多)【全日制本科生】81人
    形势与政策Ⅰ春夏{第1-8周|2节/双周}金敏紫金港东1B-306(多)【全日制本科生】90人
    形势与政策Ⅰ春夏{第1-8周|2节/双周}金敏紫金港东1B-306(多)【全日制本科生】90人`

    const classroom = `考试春{第9周|2节}【考试】人博士生入学考试春{第2-2|3节/周}【借用】人补课春{第6-6|3节/周}【借用】人`

    const rule = /{第/g

    function fish(form){
        let first, last, sum
        return rule.exec(form)
    }

    console.log(fish(classroom))